[View in Colaboratory](https://colab.research.google.com/github/tkms0106/python-data-science/blob/master/python_data_science4_20.ipynb)

In [0]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [0]:
ser1 = Series([0,1,2],index=['A','B','C'])

In [3]:
ser1

A    0
B    1
C    2
dtype: int64

In [0]:
ser2 = Series([3,4,5,6],index=['A','B','C','D'])

In [5]:
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [6]:
ser1 + ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [0]:
dframe1 = DataFrame(np.arange(4).reshape((2,2)), columns=list('AB'),index=['NYC','LA'])

In [8]:
dframe1

     A  B
NYC  0  1
LA   2  3

In [0]:
dframe2 = DataFrame(np.arange(9).reshape((3,3)),columns=list('ADC'),index=['NYC','SF','LA'])

In [11]:
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [12]:
dframe1 + dframe2

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [13]:
dframe1.add(dframe2, fill_value=0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [14]:
ser3 = dframe2.ix[0]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [15]:
ser3

A    0
D    1
C    2
Name: NYC, dtype: int64

In [16]:
dframe2 - ser3

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6